{
    "categorias": [
      {
        "nome": "Pratos Típicos Brasileiros",
        "receitas": [
          {
            "nome": "Feijoada",
            "historia": "A feijoada é um prato tradicional brasileiro, feito com feijão preto e carnes variadas.",
            "ingredientes": [
              "500g de feijão preto",
              "300g de carne seca",
              "200g de linguiça",
              "100g de bacon",
              "1 cebola",
              "1 cabeça de alho",
              "Folhas de louro"
            ],
            "modoPreparo": "Cozinhe as carnes e o feijão separadamente. Depois, refogue a cebola e o alho, adicione o feijão e as carnes e cozinhe até a mistura ficar bem incorporada. Sirva com arroz, farofa e couve."
          },
          {
            "nome": "Moqueca",
            "historia": "A moqueca é um prato de peixe típico da Bahia, com um sabor marcante e temperos especiais.",
            "ingredientes": [
              "1 kg de peixe",
              "1 pimentão",
              "1 cebola",
              "2 tomates",
              "1 colher de sopa de azeite de dendê",
              "1 colher de sopa de leite de coco"
            ],
            "modoPreparo": "Tempere o peixe com sal, alho e limão. Refogue a cebola, o pimentão e o tomate. Adicione o peixe e cozinhe por 30 minutos. Finalize com azeite de dendê e leite de coco."
          },
          {
            "nome": "Baião de Dois",
            "historia": "O baião de dois é um prato nordestino feito com arroz e feijão verde, geralmente servido com carne seca.",
            "ingredientes": [
              "1 xícara de arroz",
              "1 xícara de feijão verde",
              "200g de carne seca",
              "1 cebola",
              "1 pimentão",
              "Coentro a gosto"
            ],
            "modoPreparo": "Cozinhe o arroz e o feijão separadamente. Refogue a carne seca com cebola e pimentão. Misture tudo e finalize com coentro."
          },
          {
            "nome": "Virado à Paulista",
            "historia": "O virado à paulista é um prato simples e delicioso, típico do estado de São Paulo.",
            "ingredientes": [
              "500g de feijão",
              "1 linguiça calabresa",
              "200g de carne de porco",
              "1 ovo",
              "Farinha de mandioca"
            ],
            "modoPreparo": "Cozinhe o feijão e frite as carnes. Faça um arroz branco e monte o prato com o feijão, arroz, farofa e carne. Finalize com o ovo frito."
          },
          {
            "nome": "Galinhada",
            "historia": "A galinhada é um prato típico do interior do Brasil, feito com arroz e frango temperado.",
            "ingredientes": [
              "1 kg de frango",
              "2 xícaras de arroz",
              "1 pimentão",
              "1 cebola",
              "2 tomates",
              "1 colher de chá de açafrão"
            ],
            "modoPreparo": "Tempere o frango com sal e alho. Refogue a cebola, pimentão e tomates. Acrescente o frango e o arroz, cozinhe até o arroz estar pronto e o frango dourado."
          }
        ]
      },
      {
        "nome": "Massas e Pastas",
        "receitas": [
          {
            "nome": "Talharim",
            "historia": "O talharim é uma massa italiana que pode ser servida com diferentes tipos de molhos, sendo uma opção popular no Brasil.",
            "ingredientes": [
              "300g de farinha de trigo",
              "3 ovos",
              "1 colher de chá de sal"
            ],
            "modoPreparo": "Misture a farinha com o sal e adicione os ovos, amassando até formar uma massa lisa. Abra a massa com um rolo e corte em tiras finas. Cozinhe em água salgada até ficar al dente."
          },
          {
            "nome": "Lasanha de Mandica",
            "historia": "A lasanha de mandica é uma versão brasileira da lasanha, substituindo a massa tradicional pela mandioca.",
            "ingredientes": [
              "500g de mandioca cozida e amassada",
              "500g de carne moída",
              "1 cebola",
              "2 dentes de alho",
              "1 molho de tomate",
              "200g de queijo mussarela",
              "Queijo parmesão"
            ],
            "modoPreparo": "Refogue a carne moída com cebola e alho. Em um refratário, alterne camadas de mandioca, carne e queijo, finalizando com molho de tomate. Asse por 20 minutos e finalize com queijo parmesão."
          }
        ]
      },
      {
        "nome": "Carnes e Aves",
        "receitas": [
          {
            "nome": "Churrasco",
            "historia": "O churrasco é um dos pratos mais tradicionais do Brasil, sendo uma refeição social e celebrada em todo o país.",
            "ingredientes": [
              "1 kg de carne bovina (picanha, fraldinha)",
              "Sal grosso",
              "Carvão"
            ],
            "modoPreparo": "Tempere a carne com sal grosso. Asse na churrasqueira até atingir o ponto desejado. Sirva com arroz, farofa e vinagrete."
          },
          {
            "nome": "Frango com Quiabo",
            "historia": "Prato tradicional do interior, especialmente de Minas Gerais, o frango com quiabo é muito saboroso e reconfortante.",
            "ingredientes": [
              "1 kg de frango cortado em pedaços",
              "300g de quiabo",
              "1 cebola",
              "Alho a gosto",
              "Tempero verde",
              "Óleo"
            ],
            "modoPreparo": "Refogue o frango com cebola e alho. Quando estiver dourado, adicione o quiabo e o tempero verde, e cozinhe até o quiabo ficar macio. Sirva com arroz branco."
          },
          {
            "nome": "Carne de Sol",
            "historia": "A carne de sol é um prato nordestino de carne salgada e curada, que é servida com diversos acompanhamentos.",
            "ingredientes": [
              "1 kg de carne de sol",
              "Cebola",
              "Alho",
              "Azeite"
            ],
            "modoPreparo": "Deixe a carne de sol de molho por algumas horas para retirar o sal. Grelhe a carne até dourar e sirva com arroz, feijão verde e farofa."
          },
          {
            "nome": "Vaca Atolada",
            "historia": "A vaca atolada é um prato típico do interior do Brasil, feito com costela de boi e mandioca.",
            "ingredientes": [
              "1 kg de costela de boi",
              "500g de mandioca",
              "Alho",
              "Cebola",
              "Pimentão"
            ],
            "modoPreparo": "Cozinhe a costela até ficar macia. Em outra panela, cozinhe a mandioca até ficar macia. Misture a costela com a mandioca e finalize com temperos a gosto."
          }
        ]
      },
      {
        "nome": "Doces e Sobremesas",
        "receitas": [
          {
            "nome": "Cocada",
            "historia": "A cocada é um doce tradicionalmente feito com coco e açúcar, popular em diversas regiões do Brasil.",
            "ingredientes": [
              "1 coco fresco ralado",
              "2 xícaras de açúcar",
              "1 xícara de água",
              "1 colher de chá de manteiga"
            ],
            "modoPreparo": "Misture todos os ingredientes e cozinhe até o ponto de brigadeiro. Modele as cocadas e deixe esfriar."
          },
          {
            "nome": "Brigadeiro",
            "historia": "O brigadeiro é um doce clássico brasileiro, geralmente servido em festas de aniversário.",
            "ingredientes": [
              "1 lata de leite condensado",
              "2 colheres de sopa de achocolatado",
              "1 colher de sopa de manteiga"
            ],
            "modoPreparo": "Misture os ingredientes e cozinhe em fogo baixo até desgrudar do fundo da panela. Modele os brigadeiros e passe no granulado."
          },
          {
            "nome": "Quindim",
            "historia": "O quindim é uma sobremesa brasileira feita com coco, açúcar e ovos, famosa pela sua textura cremosa.",
            "ingredientes": [
              "10 gemas",
              "200g de açúcar",
              "100g de coco ralado",
              "200g de manteiga"
            ],
            "modoPreparo": "Misture os ingredientes e coloque em forminhas untadas. Asse em banho-maria por 30 minutos a 180°C."
          },
          {
            "nome": "Pé de Moleque",
            "historia": "O pé de moleque é um doce de amendoim caramelizado, muito tradicional em festas e comemorações.",
            "ingredientes": [
              "1 xícara de amendoim",
              "2 xícaras de açúcar",
              "1 colher de chá de manteiga"
            ],
            "modoPreparo": "Caramelize o açúcar até ficar dourado. Adicione o amendoim e manteiga. Mexa até secar e modele em pedaços."
          },
          {
            "nome": "Arroz Doce",
            "historia": "O arroz doce é um prato tradicional, consumido tanto como sobremesa quanto lanche, em diversas regiões do Brasil.",
            "ingredientes": [
              "1 xícara de arroz",
              "3 xícaras de leite",
              "1 xícara de açúcar",
              "Canela em pau"
            ],
            "modoPreparo": "Cozinhe o arroz com o leite até ficar bem macio. Adicione o açúcar e deixe engrossar. Finalize com canela."
          },
          {
            "nome": "Ambrosia",
            "historia": "A ambrosia é uma sobremesa que remonta ao período colonial, sendo feita com leite e ovos.",
            "ingredientes": [
              "1 litro de leite",
              "4 ovos",
              "1 xícara de açúcar",
              "Canela em pó"
            ],
            "modoPreparo": "Cozinhe o leite com o açúcar até reduzir. Adicione os ovos e cozinhe até engrossar. Finalize com canela."
          }
        ]
      }
    ]
  }
  
